
<h3>Робота з даними в системі</h3>
<p>Інформація на сторінках «Культури», «Попередники», «Добрива», «Поля», «Кліматичні зони», «Типи грунту» подана в вигляді таблиць (рис. 1), дані можна редагувати, створювати та видаляти, а також сортувати та здійснювати пошук по фільтрам. <br />
    На одній сторінці виводиться 20 записів, щоб переглянути інші записи потрібно використати пагінацію. Під таблицею виводиться кількість записів та сторінок.<br />
    Для редагування запису навпроти нього потрібно натиснути посилання «Редагувати», після цього сторінка поновлюється і можна виконувати зміну даних. <br />
    Для видалення запису потрібно натиснути на посилання «Видалити» навпроти запису, або помітити записи і в випадаючому списку під таблицею з даними вибрати дію «Видалити», а потім натиснути кнопку «Виконати».<br />
   <img  src="/img/in3.png" /><br />
  Рис. 1. Сторінка «Редагування  запису»<br />
    <br />
    Над кожною з таблиць знаходиться фільтр, за його допомогою можна знайти потрібні записи, ввівши в поле потрібний параметр і натиснувши клавішу «Фільтрувати» (рис.2). Щоб повернутись до всіх записів достатньо натиснути посилання «Скинути».<br />
    Щоб створити новий запис під таблицею з даними потрібно натисути посилання «Новий запис», після цього сторінка поновлюється і можна вводити дані. Коли всі поля заповнені потрібно натиснути кнопку «Зберегти і додати». Щоб повернутись до таблиці з записами можна натиснути на посилання «Повернутися до списку», або вибрати потрібний пункт в меню інформаційної системи.<br />
    <img  src="/img/in1.png" /><br />
Рис. 2. Пошук по  заданому фільтру</p>
<br />
<h3>Проектування сівозміни</h3>
  Після заповнення користувачем даних про культури, добрива,  поля та попередники на відповідних сторінках, перейшовши на головну сторінку,  користувач може скласти сівозміну попередньо ввівші дані про вартість пального  та середню оплату праці. <br />
  Після натискання на кнопку «Далі», система на основі даних  введених в базу пропонує сівозміну, а також виводить графіки пріоритетів по  попередниками, прибутку, кліматичні зоні, типу грунту та сумарному пріоритету.<br />
  Для зручності користувача при наведенні на колонку  будь-якого графіка виводиться інформація про культуру і значення її пріоритету.<br />
  <br />
</p>
<h3>Захист від несанкціонованого використання</h3>
<p> Для попередження використання програми особами, які не мають на те право, в системі передбачена функція авторизації. Авторизація виконується при переході на сторінку системи, користувачу пропонується ввести пароль на доступ до системи. </p>
<p>Вхід до інформаційної системи буде можливий лише в тому випадку, якщо користувач вірно вкаже пароль. Для виходу із системи потрібно натиснути кнопку «Вихід». Авторизований користувач може змінити пароль перейшовши на сторінку «Змінити пароль» </p>
