<h1>Інструкція</h1>


<p><strong>Робота з даними в системі</strong></p>
<p>Інформація на сторінках «Культури», «Попередники», «Добрива» подана в вигляді  таблиць. Над записами в них можливе виконання дій: редагування,  створення, видалення, сортування та пошук по фільтрам.<br />
  Для редагування запису навпроти нього потрібно натиснути  посилання «Редагувати», після цього сторінка обновиться і можна виконувати  зміну даних (рисунок 1). Для видалення запису потрібно натиснути на посилання  «Видалити» навпрти запису, або помітити записи і в випадаючому списку під  таблицею з даними вибрати дію «Видалити», а потім натиснути клавішу «Виконати».<br />
   <img  src="/img/in3.png" /><br />
  Рисунок 1 — Сторінка «Редагування  запису»<br />
  Створити новий запис можна натиснувши клавішу «Новий запис», яка  знаходиться під таблицею з даними.<br />
  Над кожною з таблиць знаходиться фільтр, за його допомогою можна знайти  потрібні записи, ввівши в поле потрібний параметр і натиснувши клавішу  «Фільтрувати» (рисунок 2). Щоб повернутись до всіх записів достатньо натиснути  посилання «Скинути».<br />
   <img  src="/img/in1.png" /><br />
Рисунок 2 — Пошук по  заданому фільтру</p>
<p><br />
  <strong>Проектування сівозміни</strong><br />
  Після заповнення користувачем даних про культури, добрива,  поля та попередники на відповідних сторінках, перейшовши на головну сторінку,  користувач може скласти сівозміну попередньо ввівші дані про вартість пального  та середню оплату праці (рисунок 3). <br />
  <img  src="/img/in2.png" /><br />
  Рисунок 3 — Форма заповнення даних для складанням сівозміни<br />
  Після натискання на кнопку «Далі», система на основі даних  введених в базу пропонує сівозміну, а також виводить графіки пріоритетів по  попередниками, прибутку та сумарному пріоритету.<br />
  Для зручності користувача при наведенні на колонку  будь-якого графіка виводиться інформація про культуру і значення її пріоритету.<br />
  <br />
</p>
<p><strong>Захист від несанкціонованого використання</strong></p>
<p> Для попередження використання програми особами, які не мають на те право, в системі передбачена функція авторизації. Авторизація виконується при переході на сторінку системи, користувачу пропонується ввести пароль на доступ до системи. </p>
<p>Вхід до інформаційно-аналітичної системи організації сівозмін для фермерського господарства «Левада» буде можливий лише в тому випадку, якщо користувач вірно вкаже пароль. Для виходу із системи потрібно натиснути кнопку «Вихід». Авторизований користувач може змінити пароль перейшовши на сторінку «Змінити пароль» </p>
